# YOLOv11 "Experiment H" - The Hybrid SOTA Killer
# Backbone: SCConv (From Exp F - Cleans Data)
# Neck: 3-Point ResEMA (From Exp B - Focuses Features)

nc: 9
scales:
  s: [0.50, 0.50, 1024]

backbone:
  # --- SCConv Backbone (Medical Optimized) ---
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2_SC, [256, False, 0.25]] 
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2_SC, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, C3k2_SC, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 2, C3k2_SC, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]
  - [-1, 2, C2PSA, [1024]]

head:
  # --- 3-Point ResEMA Neck (Accuracy Optimized) ---
  # Stage 1: P5 -> P4
  - [-1, 1, DySample, [2, 'lp']]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]]
  - [-1, 1, ResEMA, [512, 8]]  # Point 1

  # Stage 2: P4 -> P3
  - [-1, 1, DySample, [2, 'lp']]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, False]]
  # NO ResEMA here (Efficiency)

  # Stage 3: P3 -> P4
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 14], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]]
  - [-1, 1, ResEMA, [512, 8]]  # Point 2

  # Stage 4: P4 -> P5
  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, ResEMA, [1024, 8]] # Point 3

  - [[17, 21, 25], 1, Detect, [nc]]