# YOLOv11 "Full Stack" Medical
# EXPERIMENT D: The Ultimate Architecture
# 1. Backbone: SPD (No pixel loss) + Global ResEMA (Context)
# 2. Head: DySample (Sharp upscaling) + 3-Point ResEMA (Feature fusion)

nc: 9
scales:
  s: [0.50, 0.50, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  
  # --- SPD REPLACEMENT 1 (P2) ---
  # Standard was: Conv(stride=2). Replaced with SPD + Compress.
  - [-1, 1, SPD, [1]]          # 1 (64 -> 256 channels)
  - [-1, 1, Conv, [128, 1, 1]] # 2 (Compress 256 -> 128)
  - [-1, 2, C3k2, [256, False, 0.25]] # 3
  
  # --- SPD REPLACEMENT 2 (P3) ---
  # Critical: Preserves small fracture details
  - [-1, 1, SPD, [1]]          # 4 (256 -> 1024 channels)
  - [-1, 1, Conv, [256, 1, 1]] # 5 (Compress 1024 -> 256)
  - [-1, 2, C3k2, [512, False, 0.25]] # 6 (Output to Head P3)
  
  # --- SPD REPLACEMENT 3 (P4) ---
  - [-1, 1, SPD, [1]]          # 7 (512 -> 2048 channels)
  - [-1, 1, Conv, [512, 1, 1]] # 8 (Compress 2048 -> 512)
  - [-1, 2, C3k2, [512, True]] # 9 (Output to Head P4)
  
  # --- SPD REPLACEMENT 4 (P5) ---
  - [-1, 1, SPD, [1]]          # 10 (512 -> 2048 channels)
  - [-1, 1, Conv, [1024, 1, 1]] # 11 (Compress 2048 -> 1024)
  - [-1, 2, C3k2, [1024, True]] # 12
  
  - [-1, 1, SPPF, [1024, 5]]    # 13
  
  # --- BACKBONE ATTENTION (Global) ---
  # Forces model to understand "Anatomy" before detecting "Pathology"
  - [-1, 1, ResEMA, [1024, 8]]  # 14 (Attention Block)
  
  - [-1, 2, C2PSA, [1024]]      # 15 (Output to Head P5)

head:
  # --- Stage 1: Upsample P5 -> P4 ---
  - [-1, 1, DySample, [2, 'lp']] # 16 (Dynamic Upsampling)
  - [[-1, 9], 1, Concat, [1]]    # 17 (Cat with Backbone P4)
  - [-1, 2, C3k2, [512, False]]  # 18
  - [-1, 1, ResEMA, [512, 8]]    # 19 (Neck Attention)

  # --- Stage 2: Upsample P4 -> P3 ---
  - [-1, 1, DySample, [2, 'lp']] # 20 (Dynamic Upsampling)
  - [[-1, 6], 1, Concat, [1]]    # 21 (Cat with Backbone P3)
  - [-1, 2, C3k2, [256, False]]  # 22 (P3 Output)

  # --- Stage 3: Downsample P3 -> P4 ---
  - [-1, 1, Conv, [256, 3, 2]]   # 23
  - [[-1, 19], 1, Concat, [1]]   # 24 (Cat with ResEMA P4 from Neck)
  - [-1, 2, C3k2, [512, False]]  # 25
  - [-1, 1, ResEMA, [512, 8]]    # 26 (P4 Output + Attention)

  # --- Stage 4: Downsample P4 -> P5 ---
  - [-1, 1, Conv, [512, 3, 2]]   # 27
  - [[-1, 15], 1, Concat, [1]]   # 28 (Cat with Backbone P5)
  - [-1, 2, C3k2, [1024, True]]  # 29
  - [-1, 1, ResEMA, [1024, 8]]   # 30 (P5 Output + Attention)

  # --- Detect ---
  - [[22, 26, 30], 1, Detect, [nc]] # Detect(P3, P4, P5)