# YOLOv11-C3k2-SC_DySample_ResEMA-S.yaml
# 1. Backbone: c3k2_SC SCConv (Suppresses X-ray background)
# 2. Neck: ResEMA (Focuses on lesion texture)
# 3. Upsampling: DySample (Preserves fracture edges)

nc: 9

# --- OFFICIAL YOLOv11 SCALES ---
scales:
  # [depth, width, max_channels]
  #n: [0.50, 0.25, 1024]  
  #s: [0.50, 0.50, 1024]  
   m: [0.50, 1.00, 512]   
  #l: [1.00, 1.00, 512]   

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  
  # --- c3k2_SC REPLACEMENT 1 ---
  - [-1, 2, C3k2_SC, [256, False, 0.25]] # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  
  # --- c3k2_SC REPLACEMENT 2 ---
  - [-1, 2, C3k2_SC, [512, False, 0.25]] # 4
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  
  # --- c3k2_SC REPLACEMENT 3 ---
  - [-1, 2, C3k2_SC, [512, True]] # 6
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  
  # --- c3k2_SC REPLACEMENT 4 ---
  - [-1, 2, C3k2_SC, [1024, True]] # 8
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]]   # 10

head:
  # --- NECK STAGE 1: Upsample P5 -> P4 ---
  - [-1, 1, DySample, [2, 'lp']] # 11 
  - [[-1, 6], 1, Concat, [1]]    # 12 
  - [-1, 2, C3k2, [512, False]]  # 13
  - [-1, 1, ResEMA, [512, 8]]    # 14 

  # --- NECK STAGE 2: Upsample P4 -> P3 ---
  - [-1, 1, DySample, [2, 'lp']] # 15 
  - [[-1, 4], 1, Concat, [1]]    # 16 
  - [-1, 2, C3k2, [256, False]]  # 17
  - [-1, 1, ResEMA, [256, 8]]    # 18 

  # --- NECK STAGE 3: Downsample P3 -> P4 ---
  - [-1, 1, Conv, [256, 3, 2]]   # 19
  - [[-1, 14], 1, Concat, [1]]   # 20 
  - [-1, 2, C3k2, [512, False]]  # 21
  - [-1, 1, ResEMA, [512, 8]]    # 22 

  # --- NECK STAGE 4: Downsample P4 -> P5 ---
  - [-1, 1, Conv, [512, 3, 2]]   # 23
  - [[-1, 10], 1, Concat, [1]]   # 24 
  - [-1, 2, C3k2, [1024, True]]  # 25
  - [-1, 1, ResEMA, [1024, 8]]   # 26 

  # --- DETECT HEAD ---
  - [[18, 22, 26], 1, Detect, [nc]]