# YOLOv11-S "Smart 3-Point" SOTA
# EXPERIMENT B: Optimized Accuracy (Medium Speed)
nc: 9 
scales: 
  s: [0.50, 0.50, 1024] 

backbone:
  - [-1, 1, Conv, [64, 3, 2]] 
  - [-1, 1, Conv, [128, 3, 2]] 
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] 
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] 
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] 
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] 
  - [-1, 2, C2PSA, [1024]] 

head:
  # --- Stage 1: Upsample to P4 (Medium Res) ---
  - [-1, 1, DySample, [2, 'lp']] 
  - [[-1, 6], 1, Concat, [1]] 
  - [-1, 2, C3k2, [512, False]] 
  - [-1, 1, ResEMA, [8]]  # <--- POINT 1: Added Attention here (Smart Addition)

  # --- Stage 2: Upsample to P3 (High Res) ---
  - [-1, 1, DySample, [2, 'lp']] 
  - [[-1, 4], 1, Concat, [1]] 
  - [-1, 2, C3k2, [256, False]] 
  # NO ResEMA here (Saving ~40 GFLOPs by skipping high-res attention)

  # --- Stage 3: Downsample to P4 ---
  - [-1, 1, Conv, [256, 3, 2]] 
  - [[-1, 14], 1, Concat, [1]] # Connects to ResEMA output (idx 14)
  - [-1, 2, C3k2, [512, False]] 
  - [-1, 1, ResEMA, [8]]  # <--- POINT 2: Deep semantic attention

  # --- Stage 4: Downsample to P5 ---
  - [-1, 1, Conv, [512, 3, 2]] 
  - [[-1, 10], 1, Concat, [1]] 
  - [-1, 2, C3k2, [1024, True]] 
  - [-1, 1, ResEMA, [8]]  # <--- POINT 3: Deepest attention

  # --- Detect Head ---
  # P3(idx 17), P4(idx 21), P5(idx 25)
  - [[17, 21, 25], 1, Detect, [nc]]